Junior Year/January 2019/Assignment 5/Task 10/TUT9/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
125000
(
(1.39963 -0.563943 -0.00161787)
(1.11463 -0.477911 -0.000943263)
(0.92667 -0.425344 -0.00109748)
(0.835612 -0.401284 -0.00121515)
(0.770641 -0.382886 -0.00126359)
(0.719532 -0.366494 -0.00126944)
(0.677601 -0.350926 -0.00125117)
(0.642525 -0.33574 -0.00121905)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            outletInlet;
        outletValue     uniform (1 0 0);
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
